<?php

use yii\db\Migration;

/**
 * Class m190207_175610_distr_import_data
 */
class m190207_175610_distr_import_data extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert('{{%distr_import_template}}',['id_distr','template','split','header'],[
            [1,'apteka,product,quantity','\t','Аптека	Препарат	Количество'],
            [2,'product,apteka,quantity','\t','Номенклатура	Аптечная точка	Отгружено'],
        ]);
        $this->batchInsert('{{%product}}',['id_product','name'],[
            [2,'Первый препарат'],
            [3,'Пятый Препарат'],
            [4,'Шестой Препарат'],
            [5,'Третий препарат'],
            [6,'Препарат 4'],
            [7,'Препарат 2'],
            [8,'Препарат 8'],
            [9,'Препарат 7'],
            [10,'Препарат 9'],
        ]);
        $this->batchInsert('{{%cross}}',['id_distr','id_inital','type','name'],[
            ['2','2','2','Первый препарат'],
            ['1','2','2','Препарат 1'],
            ['1','7','2','Препарат 2'],
            ['2','7','2','Второй препарат'],
            ['1','5','2','Препарат 3'],
            ['2','5','2','Третий препарат'],
            ['1','6','2','Препарат 4'],
            ['2','6','2','Четвертый препарат'],
            ['2','1','2','Препарат 12'],
            ['1','2','1','пр-кт Маркса 15'],
            ['1','3','1','ул Кирова 32'],
            ['1','4','1','ул Блюхера 4'],
            ['1','5','1','ул Никитина 73'],
            ['2','5','1','Никитина дом 73'],
            ['2','4','1','Блюхера ул дом 4'],
            ['2','3','1','Кирова улица дом 32'],
            ['2','2','1','Маркса дом 15'],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
      $this->delete('{{%distr_import_template}}','id_distr<2');
    }
}
